<!-- 购买须知及用户使用协议 -->
<template>
  <v-dialog v-model="show" scrollable>
    <v-card>
    <v-card-text class="py-5">
      <p class="text-center body-1 font-weight-bold">购买须知及用户使用协议</p>
      <p class="font-weight-bold">尊敬的自造窗用户，请您购买付费前务必谨慎阅读以下购买须知：</p>
      <p>1.【服务购买】自造窗向您的软件付费使用服务，软件提供使用服务是按账号数量和使用年限计费的。</p>
      <p>2.【存储时限】由于自造窗系统是付费租赁的阿里云服务器，提供的免费订单数据存储服务默认时间2年，2年后您可以更具需要删除到期的订单数据。</p>
      <p>3.【付费后不能退换购买产品】请您知悉，平台上提供的软件功能付费、软件续费等软件使用付费，根据《消费者权益保护法》等规定，不适用退换货规定（有特殊说明的购买付费项目除外），请您于购买时谨慎考虑</p>
      <p class="font-weight-bold mt-10">在您购买本产品时，说明您已同意以下用户使用协议：</p>
      <p>1、不得对平台服务任何部分或平台服务之使用或获得，进行复制、拷贝、出售、转售或用于任何其它商业目的。</p>
      <p>2、不得将自造窗产品及相关服务用于任何违法行为，不得使用自造窗传播任何非法信息。</p>
      <p>3、如发现用户帐号昵称中含有不雅文字或不恰当名称的，自造窗将有权删除昵称，严重者将强制注销其账号</p>
      <p>4、昵称必须符合以下要求：</p>
      <p class="pl-5">(1) 请勿以党和国家领导人或其他社会名人的真实姓名、字号、艺名、笔名注册；</p>
      <p class="pl-5">(2) 请勿以国家机构或其他机构的名称注册；</p>
      <p class="pl-5">(3) 请勿注册不文明、不健康名字，或包含歧视、侮辱、猥亵类词语的帐号；</p>
      <p class="pl-5">(4) 请勿注册易产生歧义、引起他人误解或其它不符合法律规定的帐号。</p>
      <p>5、用户帐号的所有权归自造窗，用户购买并仅享有使用权。</p>
      <p>6、用户有义务保证密码和帐号的安全，用户利用该密码和帐号所进行的一切活动引起的任何损失或损害，由用户自行承担全部责任，本应用不承担任何责任。如用户发现帐号遭到未授权的使用或发生其他任何安全问题，应立即修改帐号密码并妥善保管，如有必要，请反馈通知本应用管理人员。因黑客行为或用户的保管疏忽导致帐号非法使用，本应用不承担任何责任。</p>
      <p>7、用户承诺对自造窗的实用过程完全符合法律规范；如用户违反本条规定造成本应用被第三人索赔的，用户应全额补偿本应用的一切费用(包括但不限于各种赔偿费、诉讼代理费及为此支出的其它合理费用)。</p>
      <p>8、当第三方认为用户发表或者上传于本应用的信息侵犯其权利，并根据《信息网络传播权保护条例》或者相关法律规定向本应用发送权利通知书时，用户同意本应用可以自行判断决定删除涉嫌侵权信息，除非用户提交书面证据材料排除侵权的可能性，本应用将不会自动恢复上述删除的信息。</p>
      <p>9、用户承诺使用过程中遵守以下规范：</p>
      <p class="pl-5">(1) 不得为任何非法目的而使用网络服务系统；</p>
      <p class="pl-5">(2) 遵守所有与网络服务有关的网络协议、规定和程序；</p>
      <p class="pl-5">(3) 不得利用本应用的服务进行任何可能对互联网的正常运转造成不利影响的行为；</p>
      <p class="pl-5">(4) 不得利用本应用服务进行任何不利于本应用的行为。</p>
      <p>10.责任声明：</p>
      <p class="pl-5">(1) 任何网站、单位或者个人如认为本应用或者本应用提供的相关内容涉嫌侵犯其合法权益，应及时向本应用提供书面权力通知，并提供身份证明、权属证明及详细侵权情况证明。本应用在收到上述法律文件后，将会尽快切断相关内容以保证相关网站、单位或者个人的合法权益得到保障；</p>
      <p class="pl-5">(2) 用户明确同意其使用本应用网络服务所存在的风险及一切后果将完全由用户本人承担，本应用对此不承担任何责任；</p>
      <p class="pl-5">(3) 本应用无法保证网络服务一定能满足用户的要求，也不保证网络服务的及时性、安全性、准确性；</p>
      <p class="pl-5">(4) 本应用不保证为方便用户而设置的外部链接的准确性和完整性，同时，对于该等外部链接指向的不由本应用实际控制的任何网页上的内容，本应用不承担任何责任。</p>
      <p>11.知识产权：</p>
      <p class="pl-5">(1) 本应用特有的标识、版面设计、编排方式等版权均属本应用享有，未经本应用许可授权，不得任意复制或转载；</p>
      <p class="pl-5">(2) 用户从本应用的服务中获得的信息，未经本应用的许可，不得任意复制或转载；</p>
      <p class="pl-5">(3) 本应用的所有内容，包括订单描述、图片等内容所有权归属于用户，任何人未经许可不可转发（用户主动分享的除外）；</p>
      <p class="pl-5">(4) 本应用所有用户上传内容仅代表用户自己的立场和观点，与本应用无关，由制作者本人承担一切法律责任；</p>
      <p class="pl-5">(5) 上述及其他任何本服务包含的内容的知识产权均受到法律保护，未经本应用、用户或相关权利人书面许可，任何人不得以任何形式进行使用或创造相关衍生作品。</p>
    </v-card-text>
    <v-card-actions class="text-center pb-5">
      <v-btn class="mx-auto" outlined color="#dddddd" height="40" min-width="90" elevation="0"
             @click="close">
        <span class="body-2" style="color: #666666;">关闭</span></v-btn>
    </v-card-actions>
    </v-card>
  </v-dialog>
</template>

<script>
export default {
  name: "agreementDialog",
  props: {
    visible: { type: Boolean, default: false },
  },
  data() {
    return {
      show: false,
    }
  },
  methods: {
    close() {
      this.show = false;
      this.$emit("close");
    }
  },
  watch: {
    visible(val) {
      this.show = val;
    }
  }
}
</script>

<style scoped>

</style>